vaishnavinandedkar/Home-Security-System/stm32f4xx project.h
#include "core_cm4.h"             /* Cortex-M4 processor and core peripherals */
#include "system_stm32f4xx.h"
#include <stdint.h>
    
    /** @addtogroup Exported_types
     * @{
     */
    /*!< STM32F10x Standard Peripheral Library old types (maintained for legacy purpose) */
    typedef int32_t  s32;
    typedef int16_t s16;
    typedef int8_t  s8;
    
    typedef const int32_t sc32;  /*!< Read Only */
    typedef const int16_t sc16;  /*!< Read Only */
    typedef const int8_t sc8;   /*!< Read Only */
    
    typedef __IO int32_t  vs32;
    typedef __IO int16_t  vs16;
    typedef __IO int8_t   vs8;
    
    typedef __I int32_t vsc32;  /*!< Read Only */
    typedef __I int16_t vsc16;  /*!< Read Only */
    typedef __I int8_t vsc8;   /*!< Read Only */
    
    typedef uint32_t  u32;
    typedef uint16_t u16;
    typedef uint8_t  u8;
    
    typedef const uint32_t uc32;  /*!< Read Only */
    typedef const uint16_t uc16;  /*!< Read Only */
    typedef const uint8_t uc8;   /*!< Read Only */
    
    typedef __IO uint32_t  vu32;
    typedef __IO uint16_t vu16;
    typedef __IO uint8_t  vu8;
    
    typedef __I uint32_t vuc32;  /*!< Read Only */
    typedef __I uint16_t vuc16;  /*!< Read Only */
    typedef __I uint8_t vuc8;   /*!< Read Only */
    
    typedef enum {RESET = 0, SET = !RESET} FlagStatus, ITStatus;
    
    typedef enum {DISABLE = 0, ENABLE = !DISABLE} FunctionalState;
#define IS_FUNCTIONAL_STATE(STATE) (((STATE) == DISABLE) || ((STATE) == ENABLE))
    
    typedef enum {ERROR = 0, SUCCESS = !ERROR} ErrorStatus;
    
    /**
     * @}
     */
    
    /** @addtogroup Peripheral_registers_structures
     * @{
     */
    
    /**
     * @brief Analog to Digital Converter
     */
    
    typedef struct
    {
        __IO uint32_t SR;     /*!< ADC status register,                         Address offset: 0x00 */
        __IO uint32_t CR1;    /*!< ADC control register 1,                      Address offset: 0x04 */
        __IO uint32_t CR2;    /*!< ADC control register 2,                      Address offset: 0x08 */
        __IO uint32_t SMPR1;  /*!< ADC sample time register 1,                  Address offset: 0x0C */
        __IO uint32_t SMPR2;  /*!< ADC sample time register 2,                  Address offset: 0x10 */
        __IO uint32_t JOFR1;  /*!< ADC injected channel data offset register 1, Address offset: 0x14 */
        __IO uint32_t JOFR2;  /*!< ADC injected channel data offset register 2, Address offset: 0x18 */
        __IO uint32_t JOFR3;  /*!< ADC injected channel data offset register 3, Address offset: 0x1C */
        __IO uint32_t JOFR4;  /*!< ADC injected channel data offset register 4, Address offset: 0x20 */
        __IO uint32_t HTR;    /*!< ADC watchdog higher threshold register,      Address offset: 0x24 */
        __IO uint32_t LTR;    /*!< ADC watchdog lower threshold register,       Address offset: 0x28 */
        __IO uint32_t SQR1;   /*!< ADC regular sequence register 1,             Address offset: 0x2C */
        __IO uint32_t SQR2;   /*!< ADC regular sequence register 2,             Address offset: 0x30 */
        __IO uint32_t SQR3;   /*!< ADC regular sequence register 3,             Address offset: 0x34 */
        __IO uint32_t JSQR;   /*!< ADC injected sequence register,              Address offset: 0x38*/
        __IO uint32_t JDR1;   /*!< ADC injected data register 1,                Address offset: 0x3C */
        __IO uint32_t JDR2;   /*!< ADC injected data register 2,                Address offset: 0x40 */
        __IO uint32_t JDR3;   /*!< ADC injected data register 3,                Address offset: 0x44 */
        __IO uint32_t JDR4;   /*!< ADC injected data register 4,                Address offset: 0x48 */
        __IO uint32_t DR;     /*!< ADC regular data register,                   Address offset: 0x4C */
    } ADC_TypeDef;
    
    typedef struct
    {
        __IO uint32_t CSR;    /*!< ADC Common status register,                  Address offset: ADC1 base address + 0x300 */
        __IO uint32_t CCR;    /*!< ADC common control register,                 Address offset: ADC1 base address + 0x304 */
        __IO uint32_t CDR;    /*!< ADC common regular data register for dual
                               AND triple modes,                            Address offset: ADC1 base address + 0x308 */
    } ADC_Common_TypeDef;
    
    
    /**
     * @brief Controller Area Network TxMailBox
     */
    
    typedef struct
    {
        __IO uint32_t TIR;  /*!< CAN TX mailbox identifier register */
        __IO uint32_t TDTR; /*!< CAN mailbox data length control and time stamp register */
        __IO uint32_t TDLR; /*!< CAN mailbox data low register */
        __IO uint32_t TDHR; /*!< CAN mailbox data high register */
    } CAN_TxMailBox_TypeDef;
    
    /**
     * @brief Controller Area Network FIFOMailBox
     */
    
    typedef struct
    {
        __IO uint32_t RIR;  /*!< CAN receive FIFO mailbox identifier register */
        __IO uint32_t RDTR; /*!< CAN receive FIFO mailbox data length control and time stamp register */
        __IO uint32_t RDLR; /*!< CAN receive FIFO mailbox data low register */
        __IO uint32_t RDHR; /*!< CAN receive FIFO mailbox data high register */
    } CAN_FIFOMailBox_TypeDef;
    
    /**
     * @brief Controller Area Network FilterRegister
     */
    
    typedef struct
    {
        __IO uint32_t FR1; /*!< CAN Filter bank register 1 */
        __IO uint32_t FR2; /*!< CAN Filter bank register 1 */
    } CAN_FilterRegister_TypeDef;
    
    /**
     * @brief Controller Area Network
     */
    
    typedef struct
    {
        __IO uint32_t              MCR;                 /*!< CAN master control register,         Address offset: 0x00          */
        __IO uint32_t              MSR;                 /*!< CAN master status register,          Address offset: 0x04          */
        __IO uint32_t              TSR;                 /*!< CAN transmit status register,        Address offset: 0x08          */
        __IO uint32_t              RF0R;                /*!< CAN receive FIFO 0 register,         Address offset: 0x0C          */
        __IO uint32_t              RF1R;                /*!< CAN receive FIFO 1 register,         Address offset: 0x10          */
        __IO uint32_t              IER;                 /*!< CAN interrupt enable register,       Address offset: 0x14          */
        __IO uint32_t              ESR;                 /*!< CAN error status register,           Address offset: 0x18          */
        __IO uint32_t              BTR;                 /*!< CAN bit timing register,             Address offset: 0x1C          */
        uint32_t                   RESERVED0[88];       /*!< Reserved, 0x020 - 0x17F                                            */
        CAN_TxMailBox_TypeDef      sTxMailBox[3];       /*!< CAN Tx MailBox,                      Address offset: 0x180 - 0x1AC */
        CAN_FIFOMailBox_TypeDef    sFIFOMailBox[2];     /*!< CAN FIFO MailBox,                    Address offset: 0x1B0 - 0x1CC */
        uint32_t                   RESERVED1[12];       /*!< Reserved, 0x1D0 - 0x1FF                                            */
        __IO uint32_t              FMR;                 /*!< CAN filter master register,          Address offset: 0x200         */
        __IO uint32_t              FM1R;                /*!< CAN filter mode register,            Address offset: 0x204         */
        uint32_t                   RESERVED2;           /*!< Reserved, 0x208                                                    */
        __IO uint32_t              FS1R;                /*!< CAN filter scale register,           Address offset: 0x20C         */
        uint32_t                   RESERVED3;           /*!< Reserved, 0x210                                                    */
        __IO uint32_t              FFA1R;               /*!< CAN filter FIFO assignment register, Address offset: 0x214         */
        uint32_t                   RESERVED4;           /*!< Reserved, 0x218                                                    */
        __IO uint32_t              FA1R;                /*!< CAN filter activation register,      Address offset: 0x21C         */
        uint32_t                   RESERVED5[8];        /*!< Reserved, 0x220-0x23F                                              */
        CAN_FilterRegister_TypeDef sFilterRegister[28]; /*!< CAN Filter Register,                 Address offset: 0x240-0x31C   */
    } CAN_TypeDef;
    
    /**
     * @brief CRC calculation unit
     */
    
    typedef struct
    {
        __IO uint32_t DR;         /*!< CRC Data register,             Address offset: 0x00 */
        __IO uint8_t  IDR;        /*!< CRC Independent data register, Address offset: 0x04 */
        uint8_t       RESERVED0;  /*!< Reserved, 0x05                                      */
        uint16_t      RESERVED1;  /*!< Reserved, 0x06                                      */
        __IO uint32_t CR;         /*!< CRC Control register,          Address offset: 0x08 */
    } CRC_TypeDef;
    
    /**
     * @brief Digital to Analog Converter
     */
    
    typedef struct
    {
        __IO uint32_t CR;       /*!< DAC control register,                                    Address offset: 0x00 */
        __IO uint32_t SWTRIGR;  /*!< DAC software trigger register,                           Address offset: 0x04 */
        __IO uint32_t DHR12R1;  /*!< DAC channel1 12-bit right-aligned data holding register, Address offset: 0x08 */
        __IO uint32_t DHR12L1;  /*!< DAC channel1 12-bit left aligned data holding register,  Address offset: 0x0C */
        __IO uint32_t DHR8R1;   /*!< DAC channel1 8-bit right aligned data holding register,  Address offset: 0x10 */
        __IO uint32_t DHR12R2;  /*!< DAC channel2 12-bit right aligned data holding register, Address offset: 0x14 */
        __IO uint32_t DHR12L2;  /*!< DAC channel2 12-bit left aligned data holding register,  Address offset: 0x18 */
        __IO uint32_t DHR8R2;   /*!< DAC channel2 8-bit right-aligned data holding register,  Address offset: 0x1C */
        __IO uint32_t DHR12RD;  /*!< Dual DAC 12-bit right-aligned data holding register,     Address offset: 0x20 */
        __IO uint32_t DHR12LD;  /*!< DUAL DAC 12-bit left aligned data holding register,      Address offset: 0x24 */
        __IO uint32_t DHR8RD;   /*!< DUAL DAC 8-bit right aligned data holding register,      Address offset: 0x28 */
        __IO uint32_t DOR1;     /*!< DAC channel1 data output register,                       Address offset: 0x2C */
        __IO uint32_t DOR2;     /*!< DAC channel2 data output register,                       Address offset: 0x30 */
        __IO uint32_t SR;       /*!< DAC status register,                                     Address offset: 0x34 */
    } DAC_TypeDef;
    
    /**
     * @brief Debug MCU
     */
    
    typedef struct
    {
        __IO uint32_t IDCODE;  /*!< MCU device ID code,               Address offset: 0x00 */
        __IO uint32_t CR;      /*!< Debug MCU configuration register, Address offset: 0x04 */
        __IO uint32_t APB1FZ;  /*!< Debug MCU APB1 freeze register,   Address offset: 0x08 */
        __IO uint32_t APB2FZ;  /*!< Debug MCU APB2 freeze register,   Address offset: 0x0C */
    }DBGMCU_TypeDef;
    
    /**
     * @brief DCMI
     */
    
    typedef struct
    {
        __IO uint32_t CR;       /*!< DCMI control register 1,                       Address offset: 0x00 */
        __IO uint32_t SR;       /*!< DCMI status register,                          Address offset: 0x04 */
        __IO uint32_t RISR;     /*!< DCMI raw interrupt status register,            Address offset: 0x08 */
        __IO uint32_t IER;      /*!< DCMI interrupt enable register,                Address offset: 0x0C */
        __IO uint32_t MISR;     /*!< DCMI masked interrupt status register,         Address offset: 0x10 */
        __IO uint32_t ICR;      /*!< DCMI interrupt clear register,                 Address offset: 0x14 */
        __IO uint32_t ESCR;     /*!< DCMI embedded synchronization code register,   Address offset: 0x18 */
        __IO uint32_t ESUR;     /*!< DCMI embedded synchronization unmask register, Address offset: 0x1C */
        __IO uint32_t CWSTRTR;  /*!< DCMI crop window start,                        Address offset: 0x20 */
        __IO uint32_t CWSIZER;  /*!< DCMI crop window size,                         Address offset: 0x24 */
        __IO uint32_t DR;       /*!< DCMI data register,                            Address offset: 0x28 */
    } DCMI_TypeDef;
    
    /**
     * @brief DMA Controller
     */
    
    typedef struct
    {
        __IO uint32_t CR;     /*!< DMA stream x configuration register      */
        __IO uint32_t NDTR;   /*!< DMA stream x number of data register     */
        __IO uint32_t PAR;    /*!< DMA stream x peripheral address register */
        __IO uint32_t M0AR;   /*!< DMA stream x memory 0 address register   */
        __IO uint32_t M1AR;   /*!< DMA stream x memory 1 address register   */
        __IO uint32_t FCR;    /*!< DMA stream x FIFO control register       */
    } DMA_Stream_TypeDef;
    
    typedef struct
    {
        __IO uint32_t LISR;   /*!< DMA low interrupt status register,      Address offset: 0x00 */
        __IO uint32_t HISR;   /*!< DMA high interrupt status register,     Address offset: 0x04 */
        __IO uint32_t LIFCR;  /*!< DMA low interrupt flag clear register,  Address offset: 0x08 */
        __IO uint32_t HIFCR;  /*!< DMA high interrupt flag clear register, Address offset: 0x0C */
    } DMA_TypeDef;
    
    /**
     * @brief Ethernet MAC
     */
    
    typedef struct
    {
        __IO uint32_t MACCR;
        __IO uint32_t MACFFR;
        __IO uint32_t MACHTHR;
        __IO uint32_t MACHTLR;
        __IO uint32_t MACMIIAR;
        __IO uint32_t MACMIIDR;
        __IO uint32_t MACFCR;
        __IO uint32_t MACVLANTR;             /*    8 */
        uint32_t      RESERVED0[2];
        __IO uint32_t MACRWUFFR;             /*   11 */
        __IO uint32_t MACPMTCSR;
        uint32_t      RESERVED1[2];
        __IO uint32_t MACSR;                 /*   15 */
        __IO uint32_t MACIMR;
        __IO uint32_t MACA0HR;
        __IO uint32_t MACA0LR;
        __IO uint32_t MACA1HR;
        __IO uint32_t MACA1LR;
        __IO uint32_t MACA2HR;
        __IO uint32_t MACA2LR;
        __IO uint32_t MACA3HR;
        __IO uint32_t MACA3LR;               /*   24 */
        uint32_t      RESERVED2[40];
        __IO uint32_t MMCCR;                 /*   65 */
        __IO uint32_t MMCRIR;
        __IO uint32_t MMCTIR;
        __IO uint32_t MMCRIMR;
        __IO uint32_t MMCTIMR;               /*   69 */
        uint32_t      RESERVED3[14];
        __IO uint32_t MMCTGFSCCR;            /*   84 */
        __IO uint32_t MMCTGFMSCCR;
        uint32_t      RESERVED4[5];
        __IO uint32_t MMCTGFCR;
        uint32_t      RESERVED5[10];
        __IO uint32_t MMCRFCECR;
        __IO uint32_t MMCRFAECR;
        uint32_t      RESERVED6[10];
        __IO uint32_t MMCRGUFCR;
        uint32_t      RESERVED7[334];
        __IO uint32_t PTPTSCR;
        __IO uint32_t PTPSSIR;
        __IO uint32_t PTPTSHR;
        __IO uint32_t PTPTSLR;
        __IO uint32_t PTPTSHUR;
        __IO uint32_t PTPTSLUR;
        __IO uint32_t PTPTSAR;
        __IO uint32_t PTPTTHR;
        __IO uint32_t PTPTTLR;
        __IO uint32_t RESERVED8;
        __IO uint32_t PTPTSSR;
        uint32_t      RESERVED9[565];
        __IO uint32_t DMABMR;
        __IO uint32_t DMATPDR;
        __IO uint32_t DMARPDR;
        __IO uint32_t DMARDLAR;
        __IO uint32_t DMATDLAR;
        __IO uint32_t DMASR;
        __IO uint32_t DMAOMR;
        __IO uint32_t DMAIER;
        __IO uint32_t DMAMFBOCR;
        __IO uint32_t DMARSWTR;
        uint32_t      RESERVED10[8];
        __IO uint32_t DMACHTDR;
        __IO uint32_t DMACHRDR;
        __IO uint32_t DMACHTBAR;
        __IO uint32_t DMACHRBAR;
    } ETH_TypeDef;
    
    /**
     * @brief External Interrupt/Event Controller
     */
    
    typedef struct
    {
        __IO uint32_t IMR;    /*!< EXTI Interrupt mask register,            Address offset: 0x00 */
        __IO uint32_t EMR;    /*!< EXTI Event mask register,                Address offset: 0x04 */
        __IO uint32_t RTSR;   /*!< EXTI Rising trigger selection register,  Address offset: 0x08 */
        __IO uint32_t FTSR;   /*!< EXTI Falling trigger selection register, Address offset: 0x0C */
        __IO uint32_t SWIER;  /*!< EXTI Software interrupt event register,  Address offset: 0x10 */
        __IO uint32_t PR;     /*!< EXTI Pending register,                   Address offset: 0x14 */
    } EXTI_TypeDef;
    
    /**
     * @brief FLASH Registers
     */
    
    typedef struct
    {
        __IO uint32_t ACR;      /*!< FLASH access control register, Address offset: 0x00 */
        __IO uint32_t KEYR;     /*!< FLASH key register,            Address offset: 0x04 */
        __IO uint32_t OPTKEYR;  /*!< FLASH option key register,     Address offset: 0x08 */
        __IO uint32_t SR;       /*!< FLASH status register,         Address offset: 0x0C */
        __IO uint32_t CR;       /*!< FLASH control register,        Address offset: 0x10 */
        __IO uint32_t OPTCR;    /*!< FLASH option control register, Address offset: 0x14 */
    } FLASH_TypeDef;
    
    /**
     * @brief Flexible Static Memory Controller
     */
    
    typedef struct
    {
        __IO uint32_t BTCR[8];    /*!< NOR/PSRAM chip-select control register(BCR) and chip-select timing register(BTR), Address offset: 0x00-1C */
    } FSMC_Bank1_TypeDef;
    
    /**
     * @brief Flexible Static Memory Controller Bank1E
     */
    
    typedef struct
    {
        __IO uint32_t BWTR[7];    /*!< NOR/PSRAM write timing registers, Address offset: 0x104-0x11C */
    } FSMC_Bank1E_TypeDef;
    
    /**
     * @brief Flexible Static Memory Controller Bank2
     */
    
    typedef struct
    {
        __IO uint32_t PCR2;       /*!< NAND Flash control register 2,                       Address offset: 0x60 */
        __IO uint32_t SR2;        /*!< NAND Flash FIFO status and interrupt register 2,     Address offset: 0x64 */
        __IO uint32_t PMEM2;      /*!< NAND Flash Common memory space timing register 2,    Address offset: 0x68 */
        __IO uint32_t PATT2;      /*!< NAND Flash Attribute memory space timing register 2, Address offset: 0x6C */
        uint32_t      RESERVED0;  /*!< Reserved, 0x70                                                            */
        __IO uint32_t ECCR2;      /*!< NAND Flash ECC result registers 2,                   Address offset: 0x74 */
    } FSMC_Bank2_TypeDef;
    
    /**
     * @brief Flexible Static Memory Controller Bank3
     */
    
    typedef struct
    {
        __IO uint32_t PCR3;       /*!< NAND Flash control register 3,                       Address offset: 0x80 */
        __IO uint32_t SR3;        /*!< NAND Flash FIFO status and interrupt register 3,     Address offset: 0x84 */
        __IO uint32_t PMEM3;      /*!< NAND Flash Common memory space timing register 3,    Address offset: 0x88 */
        __IO uint32_t PATT3;      /*!< NAND Flash Attribute memory space timing register 3, Address offset: 0x8C */
        uint32_t      RESERVED0;  /*!< Reserved, 0x90                                                            */
        __IO uint32_t ECCR3;      /*!< NAND Flash ECC result registers 3,                   Address offset: 0x94 */
    } FSMC_Bank3_TypeDef;
    
    /**
     * @brief Flexible Static Memory Controller Bank4
     */
    
    typedef struct
    {
        __IO uint32_t PCR4;       /*!< PC Card  control register 4,                       Address offset: 0xA0 */
        __IO uint32_t SR4;        /*!< PC Card  FIFO status and interrupt register 4,     Address offset: 0xA4 */
        __IO uint32_t PMEM4;      /*!< PC Card  Common memory space timing register 4,    Address offset: 0xA8 */
        __IO uint32_t PATT4;      /*!< PC Card  Attribute memory space timing register 4, Address offset: 0xAC */
        __IO uint32_t PIO4;       /*!< PC Card  I/O space timing register 4,              Address offset: 0xB0 */
    } FSMC_Bank4_TypeDef;
    
    /**
     * @brief General Purpose I/O
     */
    
    typedef struct
    {
        __IO uint32_t MODER;    /*!< GPIO port mode register,               Address offset: 0x00      */
        __IO uint32_t OTYPER;   /*!< GPIO port output type register,        Address offset: 0x04      */
        __IO uint32_t OSPEEDR;  /*!< GPIO port output speed register,       Address offset: 0x08      */
        __IO uint32_t PUPDR;    /*!< GPIO port pull-up/pull-down register,  Address offset: 0x0C      */
        __IO uint32_t IDR;      /*!< GPIO port input data register,         Address offset: 0x10      */
        __IO uint32_t ODR;      /*!< GPIO port output data register,        Address offset: 0x14      */
        __IO uint16_t BSRRL;    /*!< GPIO port bit set/reset low register,  Address offset: 0x18      */
        __IO uint16_t BSRRH;    /*!< GPIO port bit set/reset high register, Address offset: 0x1A      */
        __IO uint32_t LCKR;     /*!< GPIO port configuration lock register, Address offset: 0x1C      */
        __IO uint32_t AFR[2];   /*!< GPIO alternate function registers,     Address offset: 0x20-0x24 */
    } GPIO_TypeDef;
    
    /**
     * @brief System configuration controller
     */
    
    typedef struct
    {
        __IO uint32_t MEMRMP;       /*!< SYSCFG memory remap register,                      Address offset: 0x00      */
        __IO uint32_t PMC;          /*!< SYSCFG peripheral mode configuration register,     Address offset: 0x04      */
        __IO uint32_t EXTICR[4];    /*!< SYSCFG external interrupt configuration registers, Address offset: 0x08-0x14 */
        uint32_t      RESERVED[2];  /*!< Reserved, 0x18-0x1C                                                          */
        __IO uint32_t CMPCR;        /*!< SYSCFG Compensation cell control register,         Address offset: 0x20      */
    } SYSCFG_TypeDef;
    
    /**
     * @brief Inter-integrated Circuit Interface
     */
    
